<h1>PHP - 3.<!--  Основы PHP. Ассоциативные массивы --></h1>

<?php 

	echo "<h2>Ассоциативные массивы</h2>";
	echo "<h3>Список книг</h3>";

	$arrayBooks = array(
						"Рей Брэдбери" => "451° по Фаренгейту",
						"Грегори Дэвид Робертс" => "Шантарам",
						"Джордж Оруэлл" => "1984",
						"Михаил Афанасьевич Булгаков" => "Мастер и Маргарита",
						"Эрих Мария Ремарк" => "Три товарища",
						"Оскар Уайльд" => "Портрет Дориана Грея",
						"Рей Брэдбери " => "Вино из одуванчиков",
						"Даниел Киз" => "Цветы для Элджернона",
						"Джером Д. Сэлинджер" => "Над пропастью во ржи",
						"Антуан де Сент-Экзюпери" => "Маленький принц",
						"Лев Толстой" => "Анна Каренина",
						"Габриэль Гарсиа Маркес" => "Сто лет одиночества",
						"Грегори Дэвид Робертс " => "Тень горы",
						"Айн Рэнд" => "Атлант расправил плечи",
					 );
	print_r($arrayBooks);
	echo "<ol>";
	foreach ($arrayBooks as $author => $book) {
		echo "<li>$author <br> $book</li>";
		}
	echo "</ol>";
 ?>
 